FROM mysql:8.0.30
COPY ./db/conf.d /etc/mysql/conf.d
COPY ./db/initdb.d /docker-entrypoint-initdb.d

RUN chmod 644 /etc/mysql/conf.d/my.cnf
# 644 의미
# 6 (읽기 + 쓰기)
# 4 (읽기)
# 0(없음)

#숫자 644는 다음과 같이 세 부분으로 나뉩니다:
#
#첫 번째 숫자 6은 파일 소유자의 권한을 나타냅니다.
#두 번째 숫자 4는 같은 그룹의 다른 사용자들의 권한을 나타냅니다.
#세 번째 숫자 4는 다른 모든 사용자들의 권한을 나타냅니다.

#따라서 644는 다음과 같은 권한을 의미합니다:
#
#소유자 (owner): 읽기 및 쓰기 (6 = 4 + 2)
#그룹 (group): 읽기 (4)
#다른 사용자 (others): 읽기 (4)
#즉, chmod 644 /etc/mysql/conf.d/my.cnf 명령어는 my.cnf 파일에 대해:
#
#소유자에게 읽기 및 쓰기 권한을 부여하고 (rw-)
#그룹 사용자에게 읽기 권한만 부여하고 (r--)
#다른 모든 사용자에게도 읽기 권한만 부여합니다 (r--).
#이렇게 설정하면 파일 소유자는 파일을 읽고 쓸 수 있지만, 그룹과 다른 모든 사용자는 파일을 읽기만 할 수 있습니다.
#





